#+TITLE: Elam's =emacs= Configuration
#+AUTHOR: Elam Day-Friedland

* Org Capture templates and bindings
#+begin_src emacs-lisp


  (setq org-capture-templates
        '(("r" "Read" entry
           (file+headline (lambda () (expand-file-name "notes.org" elamdf/projects-dir)) "Reading List")
           "* READ %^{Title} by %^{Author} %^g: %?
    :PROPERTIES:
    :ENTERED: %U
    :END
    ")


          ("w" "Watch" entry
           (file+headline  (lambda () (expand-file-name "notes.org" elamdf/projects-dir)) "Watch List")
           ;; (file+headline (expand-file-name "capture.org" elamdf/projects-dir) "Watch List")

           "* WATCH %^{Title} %^g: %?
    :PROPERTIES:
    :ENTERED: %U
    :URL: %^{URL}
    :END:
  ")

          ("t" "TODO" entry (file+olp  (lambda () (expand-file-name "notes.org" elamdf/projects-dir)) "TODOs")
           "* TODO %?
    :PROPERTIES:
    :ENTERED: %U
    :END:
    " :empty-lines-after 1)

          ("l" "Log" entry (file+olp  (lambda () (expand-file-name "notes.org" elamdf/projects-dir)) "Log")
           "* %?
    :PROPERTIES:
    :ENTERED: %U
    :END:
    " :empty-lines-after 1)
          ("i" "Idea" entry (file+olp  (lambda () (expand-file-name "notes.org" elamdf/projects-dir)) "Ideas")
           "* IDEA %?
    :PROPERTIES:
    :ENTERED: %U
    :END:
    " :empty-lines-after 1)
          ("s" "Quote" entry (file+olp  (lambda () (expand-file-name "notes.org" elamdf/projects-dir)) "Quotes")
           "* \"%i%?\"
    :PROPERTIES:
    :ENTERED: %U
    :END:
    " :empty-lines-after 1)
          ("R" "Read from Zotero" entry (file+olp  (lambda () (expand-file-name "notes.org" elamdf/projects-dir)) "Reading List")
           "* READ %(elamdf/zotero-latest-capture-string)
    :ENTERED: %U
    :END:
    %?" :empty-lines-after 1)
          ("e" "Elfeed article" entry
           (file+olp  (lambda () (expand-file-name "notes.org" elamdf/projects-dir)) "Reading List")
           "* [[%:link][%:description]]
      :PROPERTIES:
      :LINK: %:link
      :AUTHOR: %:authors
      :ENTERED: %U
      :END:
    %?" :empty-lines-after 1)))
  (defun elamdf/org-capture-elfeed ()
    (interactive)
    (org-capture nil "e"))
  (setq org-agenda-sorting-strategy
        '((agenda user-defined-up) (todo user-defined-up)
          (tags urgency-down category-keep) (search category-keep))
        )
  (setq org-agenda-cmp-user-defined 'elamdf/compare-todo-status)

  (defun elamdf/capture-open-message ()
    (progn (message "\"if one holds onto every glimmer of genius for years, then even the dullest person may look a bit like a genius himself\"") ()))
  (add-hook 'org-capture-mode-hook #'elamdf/capture-open-message)

  (setq org-agenda-files (directory-files-recursively elamdf/projects-dir "^[a-z0-9]*.org$"))

  (setq org-refile-targets '((nil :maxlevel . 9)
                             (org-agenda-files :maxlevel . 9)))
  (setq org-outline-path-complete-in-steps nil)         ; Refile in a single go
  (setq org-refile-use-outline-path t)                  ; Show full paths for refiling

  (use-package zotxt :after org)
  (setq org-todo-keywords '((sequence "TODO(t)" "WAIT(w@/!)" "WATCH(v)" "READ(r)" "|" "DONE(d!)" "CANCELED(c@)")))
  (setq org-todo-keyword-faces '(("READ" . "dark green") ("IDEA" . "white") ("WATCH" . "dark blue")))
  (setq org-src-fontify-natively t)
  (use-package htmlize)
  (setq org-export-publishing-directory "./assets")
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)))

  (use-package ox-reveal) ; reveal js presentations!n
  (setq org-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
  (setq org-hide-emphasis-markers t)

  (use-package org-present)

  (add-hook 'org-present-mode-hook #'(lambda ()
                                       (progn
                                         (olivetti-mode t)
                                         (visual-line-mode t))
                                       ))

#+END_SRC

#+RESULTS:
| #[nil ((progn (olivetti-mode t) (visual-line-mode t))) nil] |


